// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Menus */
"Menu About" = "О приложении Chrome OS Image Creator";
"Menu Prefs" = "Настройки";
"Menu Services" = "Службы";
"Menu Hide" = "Скрыть Chrome OS Image Creator";
"Menu Hide Others" = "Скрыть остальные";
"Menu Show All" = "Показать все";
"Menu Quit" = "Выйти из Chrome OS Image Creator";
"Menu Window" = "Окно";
"Menu Minimize" = "Свернуть";
"Menu Zoom" = "Масштаб";
"Menu Bring All To Front" = "Все на передний план";
"Menu Help" = "Справка";
"Menu App Help" = "Справка Chrome OS Image Creator";

/* Buttons */
"Button Previous" = "Пред";
"Button Next" = "След";
"Button Stop" = "Остановить";
"Button Done" = "Готово";

/* Tab: Select device model */
"Text Welcome" = "С помощью этого инструмента можно создать SD-карту или USB-носитель для восстановления устройства под управлением Chrome OS.\n\nВведите номер модели устройства (например, SAMS ALEX BETA-US 8738). Он указан в нижней части экрана, на котором предлагается подключить накопитель для восстановления.";
"Text Model" = "Модель:";
"Button Local Image" = "На компьютере";

/* Tab: Select USB stick */
"Text Select Prompt" = "Выберите съемный диск для восстановления:";
"Text Insertion Prompt" = "Вставьте SD-карту или USB-носитель.";

/* Tab: Done */
"Text Congrats" = "Накопитель готов к работе. Теперь его можно отключить и использовать для восстановления устройства под управлением Chrome OS.";

/* Sizes */
"Size Bytes" = " Б";
"Size Kilobytes" = " КБ";
"Size Megabytes" = " МБ";
"Size Gigabytes" = " ГБ";
"Size Terabytes" = " ТБ";
"Size Petabytes" = " ПБ";

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "Невозможно запустить приложение.";
"NoDiskArb Informative" = "При запуске Disk Arbitration произошла ошибка. Это недопустимо.";
"NoDiskArb OK" = "ОК";

/* Error retrieving config file. */
"CantGetConfig Message" = "Не удается извлечь список образов.";
"CantGetConfig Informative" = "Произошла ошибка при получении списка доступных образов восстановления (%1$@). Проверьте подключение к сети.";
"CantGetConfig OK" = "ОК";
"CantGetConfig Error NoConnection" = "не удалось разместить соединение";
"CantGetConfig Error DownloadError" = "при загрузке произошла ошибка";
"CantGetConfig Error StringCreate" = "не удалось использовать ответ";

/* Version error. */
"VersionError Message" = "Эта версия приложения уже устарела.";
"VersionError Informative" = "Загрузите новую версию. Установлена версия %1$@; требуется версия не ниже %2$@. %3$@.";
"VersionError OK" = "Загрузить новую версию";

/* File dialog to select a local file. */
"SelectLocal File" = "Выберите образ:";
"SelectLocal Button" = "Выбрать";

/* Alert on writing stick. */
"WriteAlert Message" = "Удалить окончательно все данные с устройства %1$@?";
"WriteAlert Informative" = "Все данные будут окончательно удалены. Это действие нельзя отменить.";
"WriteAlert Cancel" = "Не очищать";
"WriteAlert OK" = "Очистить";

"TooSmallAlert Message" = "Невозможно использовать накопитель %1$@. Мало памяти.";
"TooSmallAlert Informative" = "Необходима SD-карта или USB-носитель с объемом памяти не менее %2$@.";
"TooSmallAlert OK" = "ОК";

"NotWritable Message" = "Невозможно использовать накопитель %1$@. Он защищен от записи.";
"NotWritable Informative" = "SD-карта или USB-носитель доступен только для чтения. Переключите устройство в режим записи. Если такая возможность не предусмотрена, носитель использовать нельзя.";
"NotWritable OK" = "ОК";

"Label SD Card" = "SD-карта";

/* Stick writing statuses. */
"Status Downloading" = "Загрузка…";
"Status Verifying Image" = "Проверка образа восстановления…";
"Status Unpacking" = "Распаковка…";
"Status Claiming" = "Регистрация…";
"Status Unmounting" = "Отключение…";
"Status Writing" = "Запись…";
"Status Verifying Media" = "Проверка накопителя для восстановления…";
"Status Ejecting" = "Извлечение…";
"Status Done" = "Готово!";

"StatusAdd Attempt" = " (попытка %1$d)";

/* Errors */
"Failure Downloading" = "Произошла ошибка (не удалось загрузить исходный образ). Повторить попытку?";
"Failure Verifying Return Value" = "Произошла ошибка (не удалось загрузить исходный образ, ошибка программы, %1$s). Повторить попытку?";
"Failure Verifying SHA Mismatch" = "Произошла ошибка (не удалось загрузить исходный образ, ошибка контрольной суммы). Повторить попытку?";
"Failure Unpacking" = "Произошла ошибка (не удалось загрузить исходный образ, %1$s). Повторить попытку?";
"Failure Claiming" = "Произошла ошибка (не удалось зарегистрировать USB-накопитель). Повторить попытку?";
"Failure Unmounting" = "Произошла ошибка (не удалось отключить USB-накопитель). Повторить попытку?";
"Failure Opening Source Image" = "Произошла ошибка (не удалось открыть исходный образ, %1$s). Повторить попытку?";
"Failure Opening Destination Device" = "Произошла ошибка (не удалось открыть USB-накопитель, %1$s). Повторить попытку?";
"Failure Reading Source Image" = "Произошла ошибка (не удалось прочитать исходный образ, %1$s). Повторить попытку?";
"Failure Writing Destination Device" = "Произошла ошибка (не удалось записать данные на USB-накопитель, %1$s). Повторить попытку?";
"Failure Reading Destination Device" = "Не удалось считать данные с USB-носителя (%1$s). Повторить попытку?";
"Failure Resetting Source Image" = "Не удалось сбросить исходный образ (%1$s). Повторить попытку?";
"Failure Resetting Destination Device" = "Не удалось сбросить память устройства (%1$s). Повторить попытку?";
"Failure Ejecting" = "Произошла ошибка (не удалось извлечь USB-накопитель). Повторить попытку?";

"Failure Try Again" = "Повторить";
"Failure Quit" = "Выход";

"Failure Termination Status" = "Статус завершения %d";

"Failure Internal Error 1" = "Неожиданный конец файла";
